HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_reg.h
/** \\brief  158, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C158u)

/** Alias (User Manual Name) for ERAY0_ESID_1S10.
* To use register names with standard convension, please use ERAY0_ESID_1S10.
*/
#define	ERAY_ESID11	(ERAY0_ESID_1S10)

/** \\brief  15C, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C15Cu)

/** Alias (User Manual Name) for ERAY0_ESID_1S11.
* To use register names with standard convension, please use ERAY0_ESID_1S11.
*/
#define	ERAY_ESID12	(ERAY0_ESID_1S11)

/** \\brief  160, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S12 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C160u)

/** Alias (User Manual Name) for ERAY0_ESID_1S12.
* To use register names with standard convension, please use ERAY0_ESID_1S12.
*/
#define	ERAY_ESID13	(ERAY0_ESID_1S12)

/** \\brief  164, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S13 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C164u)

/** Alias (User Manual Name) for ERAY0_ESID_1S13.
* To use register names with standard convension, please use ERAY0_ESID_1S13.
*/
#define	ERAY_ESID14	(ERAY0_ESID_1S13)

/** \\brief  168, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S14 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C168u)

/** Alias (User Manual Name) for ERAY0_ESID_1S14.
* To use register names with standard convension, please use ERAY0_ESID_1S14.
*/
#define	ERAY_ESID15	(ERAY0_ESID_1S14)

/** \\brief  138, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C138u)

/** Alias (User Manual Name) for ERAY0_ESID_1S2.
* To use register names with standard convension, please use ERAY0_ESID_1S2.
*/
#define	ERAY_ESID03	(ERAY0_ESID_1S2)

/** \\brief  13C, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C13Cu)

/** Alias (User Manual Name) for ERAY0_ESID_1S3.
* To use register names with standard convension, please use ERAY0_ESID_1S3.
*/
#define	ERAY_ESID04	(ERAY0_ESID_1S3)

/** \\brief  140, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C140u)

/** Alias (User Manual Name) for ERAY0_ESID_1S4.
* To use register names with standard convension, please use ERAY0_ESID_1S4.
*/
#define	ERAY_ESID05	(ERAY0_ESID_1S4)

/** \\brief  144, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S5 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C144u)

/** Alias (User Manual Name) for ERAY0_ESID_1S5.
* To use register names with standard convension, please use ERAY0_ESID_1S5.
*/
#define	ERAY_ESID06	(ERAY0_ESID_1S5)

/** \\brief  148, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S6 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C148u)

/** Alias (User Manual Name) for ERAY0_ESID_1S6.
* To use register names with standard convension, please use ERAY0_ESID_1S6.
*/
#define	ERAY_ESID07	(ERAY0_ESID_1S6)

/** \\brief  14C, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S7 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C14Cu)

/** Alias (User Manual Name) for ERAY0_ESID_1S7.
* To use register names with standard convension, please use ERAY0_ESID_1S7.
*/
#define	ERAY_ESID08	(ERAY0_ESID_1S7)

/** \\brief  150, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S8 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C150u)

/** Alias (User Manual Name) for ERAY0_ESID_1S8.
* To use register names with standard convension, please use ERAY0_ESID_1S8.
*/
#define	ERAY_ESID09	(ERAY0_ESID_1S8)

/** \\brief  154, Even Sync ID Symbol Window \note Array index shifted by 1.
 * Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual
 * ESID_1S1, ... */
#define ERAY0_ESID_1S9 /*lint --e(923)*/ (*(volatile Ifx_ERAY_ESID*)0xF001C154u)

/** Alias (User Manual Name) for ERAY0_ESID_1S9.
* To use register names with standard convension, please use ERAY0_ESID_1S9.
*/
#define	ERAY_ESID10	(ERAY0_ESID_1S9)

/** \\brief  30C, FIFO Critical Level */
#define ERAY0_FCL /*lint --e(923)*/ (*(volatile Ifx_ERAY_FCL*)0xF001C30Cu)

/** Alias (User Manual Name) for ERAY0_FCL.
* To use register names with standard convension, please use ERAY0_FCL.
*/
#define	ERAY_FCL	(ERAY0_FCL)

/** \\brief  304, FIFO Rejection Filter */
#define ERAY0_FRF /*lint --e(923)*/ (*(volatile Ifx_ERAY_FRF*)0xF001C304u)

/** Alias (User Manual Name) for ERAY0_FRF.
* To use register names with standard convension, please use ERAY0_FRF.
*/
#define	ERAY_FRF	(ERAY0_FRF)

/** \\brief  308, FIFO Rejection Filter Mask */
#define ERAY0_FRFM /*lint --e(923)*/ (*(volatile Ifx_ERAY_FRFM*)0xF001C308u)

/** Alias (User Manual Name) for ERAY0_FRFM.
* To use register names with standard convension, please use ERAY0_FRFM.
*/
#define	ERAY_FRFM	(ERAY0_FRFM)

/** \\brief  318, FIFO Status Register */
#define ERAY0_FSR /*lint --e(923)*/ (*(volatile Ifx_ERAY_FSR*)0xF001C318u)

/** Alias (User Manual Name) for ERAY0_FSR.
* To use register names with standard convension, please use ERAY0_FSR.
*/
#define	ERAY_FSR	(ERAY0_FSR)

/** \\brief  A0, GTU Configuration Register 1 */
#define ERAY0_GTUC01 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC01*)0xF001C0A0u)

/** Alias (User Manual Name) for ERAY0_GTUC01.
* To use register names with standard convension, please use ERAY0_GTUC01.
*/
#define	ERAY_GTUC01	(ERAY0_GTUC01)

/** \\brief  A4, GTU Configuration Register 2 */
#define ERAY0_GTUC02 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC02*)0xF001C0A4u)

/** Alias (User Manual Name) for ERAY0_GTUC02.
* To use register names with standard convension, please use ERAY0_GTUC02.
*/
#define	ERAY_GTUC02	(ERAY0_GTUC02)

/** \\brief  A8, GTU Configuration Register 3 */
#define ERAY0_GTUC03 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC03*)0xF001C0A8u)

/** Alias (User Manual Name) for ERAY0_GTUC03.
* To use register names with standard convension, please use ERAY0_GTUC03.
*/
#define	ERAY_GTUC03	(ERAY0_GTUC03)

/** \\brief  AC, GTU Configuration Register 4 */
#define ERAY0_GTUC04 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC04*)0xF001C0ACu)

