HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_reg.h
/** Alias (User Manual Name) for ERAY0_GTUC04.
* To use register names with standard convension, please use ERAY0_GTUC04.
*/
#define	ERAY_GTUC04	(ERAY0_GTUC04)

/** \\brief  B0, GTU Configuration Register 5 */
#define ERAY0_GTUC05 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC05*)0xF001C0B0u)

/** Alias (User Manual Name) for ERAY0_GTUC05.
* To use register names with standard convension, please use ERAY0_GTUC05.
*/
#define	ERAY_GTUC05	(ERAY0_GTUC05)

/** \\brief  B4, GTU Configuration Register 6 */
#define ERAY0_GTUC06 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC06*)0xF001C0B4u)

/** Alias (User Manual Name) for ERAY0_GTUC06.
* To use register names with standard convension, please use ERAY0_GTUC06.
*/
#define	ERAY_GTUC06	(ERAY0_GTUC06)

/** \\brief  B8, GTU Configuration Register 7 */
#define ERAY0_GTUC07 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC07*)0xF001C0B8u)

/** Alias (User Manual Name) for ERAY0_GTUC07.
* To use register names with standard convension, please use ERAY0_GTUC07.
*/
#define	ERAY_GTUC07	(ERAY0_GTUC07)

/** \\brief  BC, GTU Configuration Register 8 */
#define ERAY0_GTUC08 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC08*)0xF001C0BCu)

/** Alias (User Manual Name) for ERAY0_GTUC08.
* To use register names with standard convension, please use ERAY0_GTUC08.
*/
#define	ERAY_GTUC08	(ERAY0_GTUC08)

/** \\brief  C0, GTU Configuration Register 9 */
#define ERAY0_GTUC09 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC09*)0xF001C0C0u)

/** Alias (User Manual Name) for ERAY0_GTUC09.
* To use register names with standard convension, please use ERAY0_GTUC09.
*/
#define	ERAY_GTUC09	(ERAY0_GTUC09)

/** \\brief  C4, GTU Configuration Register 10 */
#define ERAY0_GTUC10 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC10*)0xF001C0C4u)

/** Alias (User Manual Name) for ERAY0_GTUC10.
* To use register names with standard convension, please use ERAY0_GTUC10.
*/
#define	ERAY_GTUC10	(ERAY0_GTUC10)

/** \\brief  C8, GTU Configuration Register 11 */
#define ERAY0_GTUC11 /*lint --e(923)*/ (*(volatile Ifx_ERAY_GTUC11*)0xF001C0C8u)

/** Alias (User Manual Name) for ERAY0_GTUC11.
* To use register names with standard convension, please use ERAY0_GTUC11.
*/
#define	ERAY_GTUC11	(ERAY0_GTUC11)

/** \\brief  510, Input Buffer Command Mask */
#define ERAY0_IBCM /*lint --e(923)*/ (*(volatile Ifx_ERAY_IBCM*)0xF001C510u)

/** Alias (User Manual Name) for ERAY0_IBCM.
* To use register names with standard convension, please use ERAY0_IBCM.
*/
#define	ERAY_IBCM	(ERAY0_IBCM)

/** \\brief  514, Input Buffer Command Request */
#define ERAY0_IBCR /*lint --e(923)*/ (*(volatile Ifx_ERAY_IBCR*)0xF001C514u)

/** Alias (User Manual Name) for ERAY0_IBCR.
* To use register names with standard convension, please use ERAY0_IBCR.
*/
#define	ERAY_IBCR	(ERAY0_IBCR)

/** \\brief  8, Module Identification Register */
#define ERAY0_ID /*lint --e(923)*/ (*(volatile Ifx_ERAY_ID*)0xF001C008u)

/** Alias (User Manual Name) for ERAY0_ID.
* To use register names with standard convension, please use ERAY0_ID.
*/
#define	ERAY_ID	(ERAY0_ID)

/** \\brief  40, Service Request Line Enable */
#define ERAY0_ILE /*lint --e(923)*/ (*(volatile Ifx_ERAY_ILE*)0xF001C040u)

/** Alias (User Manual Name) for ERAY0_ILE.
* To use register names with standard convension, please use ERAY0_ILE.
*/
#define	ERAY_ILE	(ERAY0_ILE)

/** \\brief  8F4, Kernel Reset Register 0 */
#define ERAY0_KRST0 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST0*)0xF001C8F4u)

/** Alias (User Manual Name) for ERAY0_KRST0.
* To use register names with standard convension, please use ERAY0_KRST0.
*/
#define	ERAY_KRST0	(ERAY0_KRST0)

/** \\brief  8F0, Kernel Reset Register 1 */
#define ERAY0_KRST1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRST1*)0xF001C8F0u)

/** Alias (User Manual Name) for ERAY0_KRST1.
* To use register names with standard convension, please use ERAY0_KRST1.
*/
#define	ERAY_KRST1	(ERAY0_KRST1)

/** \\brief  8EC, Kernel Reset Status Clear Register */
#define ERAY0_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_ERAY_KRSTCLR*)0xF001C8ECu)

/** Alias (User Manual Name) for ERAY0_KRSTCLR.
* To use register names with standard convension, please use ERAY0_KRSTCLR.
*/
#define	ERAY_KRSTCLR	(ERAY0_KRSTCLR)

/** \\brief  1C, Lock Register */
#define ERAY0_LCK /*lint --e(923)*/ (*(volatile Ifx_ERAY_LCK*)0xF001C01Cu)

/** Alias (User Manual Name) for ERAY0_LCK.
* To use register names with standard convension, please use ERAY0_LCK.
*/
#define	ERAY_LCK	(ERAY0_LCK)

/** \\brief  314, Last Dynamic Transmit Slot */
#define ERAY0_LDTS /*lint --e(923)*/ (*(volatile Ifx_ERAY_LDTS*)0xF001C314u)

/** Alias (User Manual Name) for ERAY0_LDTS.
* To use register names with standard convension, please use ERAY0_LDTS.
*/
#define	ERAY_LDTS	(ERAY0_LDTS)

/** \\brief  70C, Message Buffer Status */
#define ERAY0_MBS /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBS*)0xF001C70Cu)

/** Alias (User Manual Name) for ERAY0_MBS.
* To use register names with standard convension, please use ERAY0_MBS.
*/
#define	ERAY_MBS	(ERAY0_MBS)

/** \\brief  340, Message Buffer Status Changed 1 */
#define ERAY0_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC1*)0xF001C340u)

/** Alias (User Manual Name) for ERAY0_MBSC1.
* To use register names with standard convension, please use ERAY0_MBSC1.
*/
#define	ERAY_MBSC1	(ERAY0_MBSC1)

/** \\brief  344, Message Buffer Status Changed 2 */
#define ERAY0_MBSC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC2*)0xF001C344u)

/** Alias (User Manual Name) for ERAY0_MBSC2.
* To use register names with standard convension, please use ERAY0_MBSC2.
*/
#define	ERAY_MBSC2	(ERAY0_MBSC2)

/** \\brief  348, Message Buffer Status Changed 3 */
#define ERAY0_MBSC3 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC3*)0xF001C348u)

/** Alias (User Manual Name) for ERAY0_MBSC3.
* To use register names with standard convension, please use ERAY0_MBSC3.
*/
#define	ERAY_MBSC3	(ERAY0_MBSC3)

/** \\brief  34C, Message Buffer Status Changed 4 */
#define ERAY0_MBSC4 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MBSC4*)0xF001C34Cu)

/** Alias (User Manual Name) for ERAY0_MBSC4.
* To use register names with standard convension, please use ERAY0_MBSC4.
*/
#define	ERAY_MBSC4	(ERAY0_MBSC4)

/** \\brief  98, MHD Configuration Register */
#define ERAY0_MHDC /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDC*)0xF001C098u)

/** Alias (User Manual Name) for ERAY0_MHDC.
* To use register names with standard convension, please use ERAY0_MHDC.
*/
#define	ERAY_MHDC	(ERAY0_MHDC)

/** \\brief  31C, Message Handler Constraints Flags */
#define ERAY0_MHDF /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDF*)0xF001C31Cu)

/** Alias (User Manual Name) for ERAY0_MHDF.
* To use register names with standard convension, please use ERAY0_MHDF.
*/
#define	ERAY_MHDF	(ERAY0_MHDF)

/** \\brief  310, Message Handler Status */
#define ERAY0_MHDS /*lint --e(923)*/ (*(volatile Ifx_ERAY_MHDS*)0xF001C310u)

/** Alias (User Manual Name) for ERAY0_MHDS.
* To use register names with standard convension, please use ERAY0_MHDS.
*/
#define	ERAY_MHDS	(ERAY0_MHDS)

/** \\brief  300, Message RAM Configuration */
#define ERAY0_MRC /*lint --e(923)*/ (*(volatile Ifx_ERAY_MRC*)0xF001C300u)

/** Alias (User Manual Name) for ERAY0_MRC.
* To use register names with standard convension, please use ERAY0_MRC.
*/
#define	ERAY_MRC	(ERAY0_MRC)

/** \\brief  3B8, Message Buffer Status Changed Interrupt Control 1 */
#define ERAY0_MSIC1 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC1*)0xF001C3B8u)

/** Alias (User Manual Name) for ERAY0_MSIC1.
* To use register names with standard convension, please use ERAY0_MSIC1.
*/
#define	ERAY_MSIC1	(ERAY0_MSIC1)

/** \\brief  3BC, Message Buffer Status Changed Interrupt Control 2 */
#define ERAY0_MSIC2 /*lint --e(923)*/ (*(volatile Ifx_ERAY_MSIC2*)0xF001C3BCu)

/** Alias (User Manual Name) for ERAY0_MSIC2.
* To use register names with standard convension, please use ERAY0_MSIC2.
*/
#define	ERAY_MSIC2	(ERAY0_MSIC2)

